---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementsNotInPlane
source: html/b96611df-72b6-4e6b-ebb4-74f205da7d9b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementsNotInPlane Property

Elements don't lie on the same plane.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsNotInPlane { get; }
```